Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.23/samv71b/atdf/ATSAMV71N19B.atdf
        <register caption="Interrupt Enable Register" name="US_IER" offset="0x0008" rw="W" size="4" atomic-op="set:US_IMR">
          <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
          <mode name="USART_LIN" caption="USART and LIN" qualifier="US_MR.USART_MODE"/>
          <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
          <mode name="LIN" caption="LIN" qualifier="US_MR.USART_MODE"/>
          <mode name="LON" caption="LON" qualifier="US_MR.USART_MODE"/>
          <mode name="LON_SPI" caption="LON and SPI mode" qualifier="US_MR.USART_MODE"/>
          <bitfield caption="RXRDY Interrupt Enable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Enable" mask="0x00000002" name="TXRDY"/>
          <bitfield modes="USART" caption="Receiver Break Interrupt Enable" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield modes="USART_LIN" caption="Framing Error Interrupt Enable" mask="0x00000040" name="FRAME"/>
          <bitfield modes="USART_LIN" caption="Parity Error Interrupt Enable" mask="0x00000080" name="PARE"/>
          <bitfield modes="USART_LIN" caption="Timeout Interrupt Enable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield modes="USART" caption="Max number of Repetitions Reached Interrupt Enable" mask="0x00000400" name="ITER"/>
          <bitfield modes="USART" caption="Non Acknowledge Interrupt Enable" mask="0x00002000" name="NACK"/>
          <bitfield modes="USART" caption="Ring Indicator Input Change Enable" mask="0x00010000" name="RIIC"/>
          <bitfield modes="USART" caption="Data Set Ready Input Change Enable" mask="0x00020000" name="DSRIC"/>
          <bitfield modes="USART" caption="Data Carrier Detect Input Change Interrupt Enable" mask="0x00040000" name="DCDIC"/>
          <bitfield modes="USART" caption="Clear to Send Input Change Interrupt Enable" mask="0x00080000" name="CTSIC"/>
          <bitfield modes="USART" caption="Manchester Error Interrupt Enable" mask="0x01000000" name="MANE"/>
          <bitfield modes="LON_SPI" caption="Underrun Error Interrupt Enable" mask="0x00000400" name="UNRE"/>
          <bitfield modes="SPI" caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event" mask="0x00080000" name="NSSE"/>
          <bitfield modes="LIN" caption="LIN Break Sent or LIN Break Received Interrupt Enable" mask="0x00002000" name="LINBK"/>
          <bitfield modes="LIN" caption="LIN Identifier Sent or LIN Identifier Received Interrupt Enable" mask="0x00004000" name="LINID"/>
          <bitfield modes="LIN" caption="LIN Transfer Completed Interrupt Enable" mask="0x00008000" name="LINTC"/>
          <bitfield modes="LIN" caption="LIN Bus Error Interrupt Enable" mask="0x02000000" name="LINBE"/>
          <bitfield modes="LIN" caption="LIN Inconsistent Synch Field Error Interrupt Enable" mask="0x04000000" name="LINISFE"/>
          <bitfield modes="LIN" caption="LIN Identifier Parity Interrupt Enable" mask="0x08000000" name="LINIPE"/>
          <bitfield modes="LIN" caption="LIN Checksum Error Interrupt Enable" mask="0x10000000" name="LINCE"/>
          <bitfield modes="LIN" caption="LIN Slave Not Responding Error Interrupt Enable" mask="0x20000000" name="LINSNRE"/>
          <bitfield modes="LIN" caption="LIN Synch Tolerance Error Interrupt Enable" mask="0x40000000" name="LINSTE"/>
          <bitfield modes="LIN" caption="LIN Header Timeout Error Interrupt Enable" mask="0x80000000" name="LINHTE"/>
          <bitfield modes="LON" caption="LON Short Frame Error Interrupt Enable" mask="0x00000040" name="LSFE"/>
          <bitfield modes="LON" caption="LON CRC Error Interrupt Enable" mask="0x00000080" name="LCRCE"/>
          <bitfield modes="LON" caption="LON Transmission Done Interrupt Enable" mask="0x01000000" name="LTXD"/>
          <bitfield modes="LON" caption="LON Collision Interrupt Enable" mask="0x02000000" name="LCOL"/>
          <bitfield modes="LON" caption="LON Frame Early Termination Interrupt Enable" mask="0x04000000" name="LFET"/>
          <bitfield modes="LON" caption="LON Reception Done Interrupt Enable" mask="0x08000000" name="LRXD"/>
          <bitfield modes="LON" caption="LON Backlog Overflow Error Interrupt Enable" mask="0x10000000" name="LBLOVFE"/>
        </register>
        <register caption="Interrupt Disable Register" name="US_IDR" offset="0x000C" rw="W" size="4" atomic-op="clear:US_IMR">
          <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
          <mode name="USART_LIN" caption="USART and LIN" qualifier="US_MR.USART_MODE"/>
          <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
          <mode name="LIN" caption="LIN" qualifier="US_MR.USART_MODE"/>
          <mode name="LON" caption="LON" qualifier="US_MR.USART_MODE"/>
          <mode name="LON_SPI" caption="LON and SPI mode" qualifier="US_MR.USART_MODE"/>
          <bitfield caption="RXRDY Interrupt Disable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Disable" mask="0x00000002" name="TXRDY"/>
          <bitfield modes="USART" caption="Receiver Break Interrupt Disable" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield modes="USART_LIN" caption="Framing Error Interrupt Disable" mask="0x00000040" name="FRAME"/>
          <bitfield modes="USART_LIN" caption="Parity Error Interrupt Disable" mask="0x00000080" name="PARE"/>
          <bitfield modes="USART_LIN" caption="Timeout Interrupt Disable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Disable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield modes="USART" caption="Max Number of Repetitions Reached Interrupt Disable" mask="0x00000400" name="ITER"/>
          <bitfield modes="USART" caption="Non Acknowledge Interrupt Disable" mask="0x00002000" name="NACK"/>
          <bitfield caption="Ring Indicator Input Change Disable" mask="0x00010000" name="RIIC"/>
          <bitfield caption="Data Set Ready Input Change Disable" mask="0x00020000" name="DSRIC"/>
          <bitfield caption="Data Carrier Detect Input Change Interrupt Disable" mask="0x00040000" name="DCDIC"/>
          <bitfield modes="USART" caption="Clear to Send Input Change Interrupt Disable" mask="0x00080000" name="CTSIC"/>
          <bitfield modes="USART" caption="Manchester Error Interrupt Disable" mask="0x01000000" name="MANE"/>
          <bitfield modes="LON_SPI" caption="SPI Underrun Error Interrupt Disable" mask="0x00000400" name="UNRE"/>
          <bitfield modes="SPI" caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event" mask="0x00080000" name="NSSE"/>
          <bitfield modes="LIN" caption="LIN Break Sent or LIN Break Received Interrupt Disable" mask="0x00002000" name="LINBK"/>
          <bitfield modes="LIN" caption="LIN Identifier Sent or LIN Identifier Received Interrupt Disable" mask="0x00004000" name="LINID"/>
          <bitfield modes="LIN" caption="LIN Transfer Completed Interrupt Disable" mask="0x00008000" name="LINTC"/>
          <bitfield modes="LIN" caption="LIN Bus Error Interrupt Disable" mask="0x02000000" name="LINBE"/>
          <bitfield modes="LIN" caption="LIN Inconsistent Synch Field Error Interrupt Disable" mask="0x04000000" name="LINISFE"/>
          <bitfield modes="LIN" caption="LIN Identifier Parity Interrupt Disable" mask="0x08000000" name="LINIPE"/>
          <bitfield modes="LIN" caption="LIN Checksum Error Interrupt Disable" mask="0x10000000" name="LINCE"/>
          <bitfield modes="LIN" caption="LIN Slave Not Responding Error Interrupt Disable" mask="0x20000000" name="LINSNRE"/>
          <bitfield modes="LIN" caption="LIN Synch Tolerance Error Interrupt Disable" mask="0x40000000" name="LINSTE"/>
          <bitfield modes="LIN" caption="LIN Header Timeout Error Interrupt Disable" mask="0x80000000" name="LINHTE"/>
          <bitfield modes="LON" caption="LON Short Frame Error Interrupt Disable" mask="0x00000040" name="LSFE"/>
          <bitfield modes="LON" caption="LON CRC Error Interrupt Disable" mask="0x00000080" name="LCRCE"/>
          <bitfield modes="LON" caption="LON Transmission Done Interrupt Disable" mask="0x01000000" name="LTXD"/>
          <bitfield modes="LON" caption="LON Collision Interrupt Disable" mask="0x02000000" name="LCOL"/>
          <bitfield modes="LON" caption="LON Frame Early Termination Interrupt Disable" mask="0x04000000" name="LFET"/>
          <bitfield modes="LON" caption="LON Reception Done Interrupt Disable" mask="0x08000000" name="LRXD"/>
          <bitfield modes="LON" caption="LON Backlog Overflow Error Interrupt Disable" mask="0x10000000" name="LBLOVFE"/>
        </register>
        <register caption="Interrupt Mask Register" name="US_IMR" offset="0x0010" rw="R" size="4" atomic-op="read:US_IMR">
          <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
          <mode name="USART_LIN" caption="USART and LIN" qualifier="US_MR.USART_MODE"/>
          <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
          <mode name="LIN" caption="LIN" qualifier="US_MR.USART_MODE"/>
          <mode name="LON" caption="LON" qualifier="US_MR.USART_MODE"/>
          <mode name="LON_SPI" caption="LON and SPI" qualifier="US_MR.USART_MODE"/>
          <bitfield caption="RXRDY Interrupt Mask" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Mask" mask="0x00000002" name="TXRDY"/>
          <bitfield modes="USART" caption="Receiver Break Interrupt Mask" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000020" name="OVRE"/>
          <bitfield modes="USART_LIN" caption="Framing Error Interrupt Mask" mask="0x00000040" name="FRAME"/>
          <bitfield modes="USART_LIN" caption="Parity Error Interrupt Mask" mask="0x00000080" name="PARE"/>
          <bitfield modes="USART_LIN" caption="Timeout Interrupt Mask" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Mask" mask="0x00000200" name="TXEMPTY"/>
          <bitfield modes="USART" caption="Max Number of Repetitions Reached Interrupt Mask" mask="0x00000400" name="ITER"/>
          <bitfield modes="USART" caption="Non Acknowledge Interrupt Mask" mask="0x00002000" name="NACK"/>
          <bitfield caption="Ring Indicator Input Change Mask" mask="0x00010000" name="RIIC"/>
          <bitfield caption="Data Set Ready Input Change Mask" mask="0x00020000" name="DSRIC"/>
          <bitfield caption="Data Carrier Detect Input Change Interrupt Mask" mask="0x00040000" name="DCDIC"/>
          <bitfield modes="USART" caption="Clear to Send Input Change Interrupt Mask" mask="0x00080000" name="CTSIC"/>
          <bitfield modes="USART" caption="Manchester Error Interrupt Mask" mask="0x01000000" name="MANE"/>
          <bitfield modes="LON_SPI" caption="SPI Underrun Error Interrupt Mask" mask="0x00000400" name="UNRE"/>
          <bitfield modes="SPI" caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event" mask="0x00080000" name="NSSE"/>
          <bitfield modes="LIN" caption="LIN Break Sent or LIN Break Received Interrupt Mask" mask="0x00002000" name="LINBK"/>
          <bitfield modes="LIN" caption="LIN Identifier Sent or LIN Identifier Received Interrupt Mask" mask="0x00004000" name="LINID"/>
          <bitfield modes="LIN" caption="LIN Transfer Completed Interrupt Mask" mask="0x00008000" name="LINTC"/>
          <bitfield modes="LIN" caption="LIN Bus Error Interrupt Mask" mask="0x02000000" name="LINBE"/>
          <bitfield modes="LIN" caption="LIN Inconsistent Synch Field Error Interrupt Mask" mask="0x04000000" name="LINISFE"/>
          <bitfield modes="LIN" caption="LIN Identifier Parity Interrupt Mask" mask="0x08000000" name="LINIPE"/>
          <bitfield modes="LIN" caption="LIN Checksum Error Interrupt Mask" mask="0x10000000" name="LINCE"/>
          <bitfield modes="LIN" caption="LIN Slave Not Responding Error Interrupt Mask" mask="0x20000000" name="LINSNRE"/>
          <bitfield modes="LIN" caption="LIN Synch Tolerance Error Interrupt Mask" mask="0x40000000" name="LINSTE"/>
          <bitfield modes="LIN" caption="LIN Header Timeout Error Interrupt Mask" mask="0x80000000" name="LINHTE"/>
          <bitfield modes="LON" caption="LON Short Frame Error Interrupt Mask" mask="0x00000040" name="LSFE"/>
          <bitfield modes="LON" caption="LON CRC Error Interrupt Mask" mask="0x00000080" name="LCRCE"/>
          <bitfield modes="LON" caption="LON Transmission Done Interrupt Mask" mask="0x01000000" name="LTXD"/>
          <bitfield modes="LON" caption="LON Collision Interrupt Mask" mask="0x02000000" name="LCOL"/>
          <bitfield modes="LON" caption="LON Frame Early Termination Interrupt Mask" mask="0x04000000" name="LFET"/>
          <bitfield modes="LON" caption="LON Reception Done Interrupt Mask" mask="0x08000000" name="LRXD"/>
          <bitfield modes="LON" caption="LON Backlog Overflow Error Interrupt Mask" mask="0x10000000" name="LBLOVFE"/>
        </register>
        <register caption="Channel Status Register" name="US_CSR" offset="0x0014" rw="R" size="4">
          <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
          <mode name="USART_LIN" caption="USART and LIN" qualifier="US_MR.USART_MODE"/>
          <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
          <mode name="LIN" caption="LIN" qualifier="US_MR.USART_MODE"/>
          <mode name="LON" caption="LON" qualifier="US_MR.USART_MODE"/>
          <mode name="LON_SPI" caption="LON and SPI" qualifier="US_MR.USART_MODE"/>
          <bitfield caption="Receiver Ready (cleared by reading US_RHR)" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Transmitter Ready (cleared by writing US_THR)" mask="0x00000002" name="TXRDY"/>
          <bitfield modes="USART" caption="Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000020" name="OVRE"/>
          <bitfield modes="USART_LIN" caption="Framing Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000040" name="FRAME"/>
          <bitfield modes="USART_LIN" caption="Parity Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000080" name="PARE"/>
          <bitfield modes="USART_LIN" caption="Receiver Timeout (cleared by writing a one to bit US_CR.STTTO)" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="Transmitter Empty (cleared by writing US_THR)" mask="0x00000200" name="TXEMPTY"/>
          <bitfield modes="USART" caption="Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT)" mask="0x00000400" name="ITER"/>
          <bitfield modes="USART" caption="Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK)" mask="0x00002000" name="NACK"/>
          <bitfield caption="Ring Indicator Input Change Flag (cleared on read)" mask="0x00010000" name="RIIC"/>
          <bitfield caption="Data Set Ready Input Change Flag (cleared on read)" mask="0x00020000" name="DSRIC"/>
          <bitfield caption="Data Carrier Detect Input Change Flag (cleared on read)" mask="0x00040000" name="DCDIC"/>
          <bitfield modes="USART" caption="Clear to Send Input Change Flag (cleared on read)" mask="0x00080000" name="CTSIC"/>
          <bitfield modes="USART" caption="Image of RI Input" mask="0x00100000" name="RI"/>
          <bitfield modes="USART" caption="Image of DSR Input" mask="0x00200000" name="DSR"/>
          <bitfield modes="USART" caption="Image of DCD Input" mask="0x00400000" name="DCD"/>
          <bitfield modes="USART" caption="Image of CTS Input" mask="0x00800000" name="CTS"/>
          <bitfield modes="USART" caption="Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA)" mask="0x01000000" name="MANERR"/>
          <bitfield modes="LON_SPI" caption="SPI Underrun Error" mask="0x00000400" name="UNRE"/>
          <bitfield modes="SPI" caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event" mask="0x00080000" name="NSSE"/>
          <bitfield modes="SPI" caption="Image of NSS Line" mask="0x00800000" name="NSS"/>
          <bitfield modes="LIN" caption="LIN Break Sent or LIN Break Received" mask="0x00002000" name="LINBK"/>
          <bitfield modes="LIN" caption="LIN Identifier Sent or LIN Identifier Received" mask="0x00004000" name="LINID"/>
          <bitfield modes="LIN" caption="LIN Transfer Completed" mask="0x00008000" name="LINTC"/>
          <bitfield modes="LIN" caption="LIN Bus Line Status" mask="0x00800000" name="LINBLS"/>
          <bitfield modes="LIN" caption="LIN Bus Error" mask="0x02000000" name="LINBE"/>
          <bitfield modes="LIN" caption="LIN Inconsistent Synch Field Error" mask="0x04000000" name="LINISFE"/>
          <bitfield modes="LIN" caption="LIN Identifier Parity Error" mask="0x08000000" name="LINIPE"/>
          <bitfield modes="LIN" caption="LIN Checksum Error" mask="0x10000000" name="LINCE"/>
          <bitfield modes="LIN" caption="LIN Slave Not Responding Error Interrupt Mask" mask="0x20000000" name="LINSNRE"/>
          <bitfield modes="LIN" caption="LIN Synch Tolerance Error" mask="0x40000000" name="LINSTE"/>
          <bitfield modes="LIN" caption="LIN Header Timeout Error" mask="0x80000000" name="LINHTE"/>
          <bitfield modes="LON" caption="LON Short Frame Error" mask="0x00000040" name="LSFE"/>
          <bitfield modes="LON" caption="LON CRC Error" mask="0x00000080" name="LCRCE"/>
          <bitfield modes="LON" caption="LON Transmission End Flag" mask="0x01000000" name="LTXD"/>
          <bitfield modes="LON" caption="LON Collision Detected Flag" mask="0x02000000" name="LCOL"/>
          <bitfield modes="LON" caption="LON Frame Early Termination" mask="0x04000000" name="LFET"/>
          <bitfield modes="LON" caption="LON Reception End Flag" mask="0x08000000" name="LRXD"/>
          <bitfield modes="LON" caption="LON Backlog Overflow Error" mask="0x10000000" name="LBLOVFE"/>
        </register>
        <register caption="Receive Holding Register" name="US_RHR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000001FF" name="RXCHR"/>
          <bitfield caption="Received Sync" mask="0x00008000" name="RXSYNH"/>
        </register>
        <register caption="Transmit Holding Register" name="US_THR" offset="0x001C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000001FF" name="TXCHR"/>
          <bitfield caption="Sync Field to be Transmitted" mask="0x00008000" name="TXSYNH"/>
        </register>
        <register caption="Baud Rate Generator Register" name="US_BRGR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x0000FFFF" name="CD"/>
          <bitfield caption="Fractional Part" mask="0x00070000" name="FP"/>
        </register>
